alibaba/AliOS-Things/platform/mcu/nrf52xxx/Drivers/iot/background_dfu/background_dfu_state.c
        }
        else
        {
            p_dfu_ctx->dfu_mode = BACKGROUND_DFU_MODE_UNICAST;
        }

        NRF_LOG_INFO("DFU trigger: init (sz=%d, crc=%0X) image (sz=%d, crc=%0X)",
                     p_dfu_ctx->init_cmd_size,
                     p_dfu_ctx->init_cmd_crc,
                     p_dfu_ctx->firmware_size,
                     p_dfu_ctx->firmware_crc);

        return true;
    }

    return false;
}

bool background_dfu_validate_trigger(background_dfu_context_t * p_dfu_ctx,
                                     const uint8_t * p_payload,
                                     uint32_t        payload_len)
{
    if (payload_len != sizeof(background_dfu_trigger_t))
    {
        NRF_LOG_ERROR("Validate trigger: size mismatch");
        return false;
    }

    if ((p_dfu_ctx->dfu_state != BACKGROUND_DFU_IDLE) &&
        (p_dfu_ctx->dfu_state != BACKGROUND_DFU_DOWNLOAD_TRIG))
    {
        NRF_LOG_ERROR("Validate trigger: DFU already in progress (s:%s).",
                (uint32_t)background_dfu_state_to_string(p_dfu_ctx->dfu_state));
        return false;
    }

    uint8_t trigger_version = (((background_dfu_trigger_t *)p_payload)->flags
                                    & TRIGGER_FLAGS_VERSION_MASK) >> TRIGGER_FLAGS_VERSION_OFFSET;
    if (trigger_version > TRIGGER_VERSION)
    {
        NRF_LOG_ERROR("Validate trigger: invalid trigger version.");
        return false;
    }

    return true;
}

bool background_dfu_process_trigger(background_dfu_context_t * p_dfu_ctx,
                                    const uint8_t * p_payload,
                                    uint32_t        payload_len)
{
    bool result = false;

    do
    {
        if (!parse_trigger(p_dfu_ctx, (background_dfu_trigger_t *)p_payload))
        {
            NRF_LOG_ERROR("Process trigger: failed to parse payload");
            break;
        }

        p_dfu_ctx->dfu_state = BACKGROUND_DFU_DOWNLOAD_TRIG;

        uint32_t err_code = background_dfu_handle_event(p_dfu_ctx,
                                                        BACKGROUND_DFU_EVENT_TRANSFER_COMPLETE);
        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_ERROR("Error in background_dfu_handle_event (%d)", err_code);
        }

        result = true;
    } while(0);

    return result;
}

/***************************************************************************************************
 * @section DFU checks
 **************************************************************************************************/

background_dfu_block_result_t background_dfu_process_block(background_dfu_context_t     * p_dfu_ctx,
                                                           const background_dfu_block_t * p_block)
{
    background_dfu_block_result_t result = block_manager_block_process(&p_dfu_ctx->block_manager,
                                                                       p_block);
    uint32_t err_code = NRF_SUCCESS;

    switch (result)
    {
        case  BACKGROUND_DFU_BLOCK_IGNORE:
            // Ignore.
            if (p_dfu_ctx->dfu_mode == BACKGROUND_DFU_MODE_MULTICAST)
            {
                restart_block_timeout_timer(p_dfu_ctx);
            }

            break;

        case BACKGROUND_DFU_BLOCK_SUCCESS:
            if (p_dfu_ctx->dfu_mode == BACKGROUND_DFU_MODE_MULTICAST)
            {
                restart_block_timeout_timer(p_dfu_ctx);
            }

            if (block_manager_is_image_complete(&p_dfu_ctx->block_manager))
            {
                err_code = background_dfu_handle_event(p_dfu_ctx,
                                                       BACKGROUND_DFU_EVENT_TRANSFER_COMPLETE);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_ERROR("Error in background_dfu_handle_event (%d)", err_code);
                }
            }
            else
            {
                // FIXME I don't like it here.
                p_dfu_ctx->block_num++;

                err_code = background_dfu_handle_event(p_dfu_ctx,
                                                       BACKGROUND_DFU_EVENT_TRANSFER_CONTINUE);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_ERROR("Error in background_dfu_handle_event (%d)", err_code);
                }
            }
            break;

        default:
            err_code = background_dfu_handle_event(p_dfu_ctx, BACKGROUND_DFU_EVENT_PROCESSING_ERROR);
            if (err_code != NRF_SUCCESS)
            {
                NRF_LOG_ERROR("Error in background_dfu_handle_event (%d)", err_code);
            }

            break;
    }

    return result;
}

/**@brief Check if installed image is different from the incoming one.
 *
 * @param[in] p_dfu_ctx A pointer to DFU client context.
 *
 * @return True if image different, false otherwise.
 *
 */
static bool is_image_different(const background_dfu_context_t * p_dfu_ctx)
{
    if (s_dfu_settings.bank_0.bank_code == NRF_DFU_BANK_INVALID)
    {
        NRF_LOG_WARNING("No image in bank 0");
        return true;
    }

    if (s_dfu_settings.bank_0.image_crc != p_dfu_ctx->firmware_crc)
    {
        NRF_LOG_WARNING("Installed image CRC is different");
        return true;
    }

    return false;
}

/**@brief Check if stored init command is valid.
 *
 * @param[in]  p_dfu_ctx A pointer to DFU client context.
 * @param[out] p_offset  An offset of completed data if init command is incomplete.
 *
 * @return True if init command is valid, false otherwise.
 *
 */
static bool is_init_command_valid(background_dfu_context_t * p_dfu_ctx, uint32_t * p_offset)
{
    nrf_dfu_res_code_t res_code;

    res_code = background_dfu_op_select(NRF_DFU_OBJ_TYPE_COMMAND,
                                        &p_dfu_ctx->max_obj_size,
                                        p_offset);

    if (res_code != NRF_DFU_RES_CODE_SUCCESS)
    {
        NRF_LOG_WARNING("Select failed");
        return false;
    }

