alibaba/AliOS-Things/platform/mcu/nrf52xxx/Drivers/iot/background_dfu/background_dfu_state.c
    // Check if a valid init command is present.
    res_code = background_dfu_op_execute(NRF_DFU_OBJ_TYPE_COMMAND);
    if (res_code != NRF_DFU_RES_CODE_SUCCESS)
    {
        NRF_LOG_ERROR("No valid init command");
        return false;
    }

    // Check if init command is the same as before.
    if (s_dfu_settings.progress.command_crc != p_dfu_ctx->init_cmd_crc)
    {
        NRF_LOG_ERROR("Init commad has changed");
        *p_offset = 0;
        p_dfu_ctx->remaining_size = 0;
        return false;
    }

    return true;
}

/***************************************************************************************************
 * @section Timer handlers
 **************************************************************************************************/

/**@brief Handler function for block request timer.
 *
 * @param[inout] p_context DFU context.
 */
static void block_request_handler(void * p_context)
{
    background_dfu_context_t * p_dfu_ctx = (background_dfu_context_t *)p_context;

    if ((p_dfu_ctx->dfu_state != BACKGROUND_DFU_DOWNLOAD_FIRMWARE) &&
        (p_dfu_ctx->dfu_state != BACKGROUND_DFU_DOWNLOAD_INIT_CMD))
    {
        return;
    }

    background_dfu_request_bitmap_t req_bmp;
    if (block_manager_request_bitmap_get(&p_dfu_ctx->block_manager, &req_bmp) &&
        (req_bmp.size > 0))
    {
        background_dfu_transport_block_request_send(p_dfu_ctx, &req_bmp);
    }

    // Reschedule the timer.
    uint32_t jitter = block_request_jitter_get();
    uint32_t err_code = app_timer_start(m_missing_block_timer, APP_TIMER_TICKS(jitter), p_dfu_ctx);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Error in app_timer_start (%d)", err_code);
    }
}

/**@brief Handler function for block timeout timer.
 *
 * @param[inout] p_context DFU context.
 */
static void block_timeout_handler(void * p_context)
{
    background_dfu_context_t * p_dfu_ctx = (background_dfu_context_t *)p_context;

    NRF_LOG_INFO("Block timeout! (b: %d)",
            block_manager_get_current_block(&p_dfu_ctx->block_manager));

    if ((p_dfu_ctx->dfu_state != BACKGROUND_DFU_DOWNLOAD_FIRMWARE) &&
        (p_dfu_ctx->dfu_state != BACKGROUND_DFU_DOWNLOAD_INIT_CMD))
    {
        return;
    }

    if (block_manager_increment_current_block(&p_dfu_ctx->block_manager))
    {
        start_block_timeout_timer(p_dfu_ctx);
    }
}

/***************************************************************************************************
 * @section API functions
 **************************************************************************************************/

/** @brief Helper function converting DFU state to string.
 *
 *  @param[in] state DFU client state.
 *
 *  @return A pointer to null terminated string with state name.
 */
const char * background_dfu_state_to_string(const background_dfu_state_t state)
{
    static const char * const names[] =
    {
        "DFU_DOWNLOAD_INIT_CMD",
        "DFU_DOWNLOAD_FIRMWARE",
        "DFU_DOWNLOAD_TRIG",
        "DFU_WAIT_FOR_RESET",
        "DFU_IDLE",
        "DFU_ERROR",
    };

    return names[(uint32_t)state - BACKGROUND_DFU_DOWNLOAD_INIT_CMD];
}

/** @brief Helper function convering DFU event name to string.
 *
 *  @param[in] state DFU client event.
 *
 *  @return A pointer to null terminated string with event name.
 */
const char * background_dfu_event_to_string(const background_dfu_even_t event)
{
    static const char * const names[] = {
        "DFU_EVENT_TRANSFER_COMPLETE",
        "DFU_EVENT_TRANSFER_CONTINUE",
        "DFU_EVENT_TRANSFER_ERROR",
        "DFU_EVENT_PROCESSING_ERROR",
    };

    return names[event];
}

uint32_t background_dfu_handle_event(background_dfu_context_t * p_dfu_ctx,
                                     background_dfu_even_t      event)
{
    uint32_t err_code = NRF_SUCCESS;

    NRF_LOG_INFO("state=%s event=%s",
                  (uint32_t)background_dfu_state_to_string(p_dfu_ctx->dfu_state),
                  (uint32_t)background_dfu_event_to_string(event));

    switch (p_dfu_ctx->dfu_state)
    {
        case BACKGROUND_DFU_IDLE:
        {
            if (event == BACKGROUND_DFU_EVENT_TRANSFER_COMPLETE)
            {
                p_dfu_ctx->dfu_diag.prev_state = BACKGROUND_DFU_IDLE;

                p_dfu_ctx->dfu_state     = BACKGROUND_DFU_DOWNLOAD_TRIG;
                p_dfu_ctx->block_num     = 0;
                p_dfu_ctx->retry_count   = DEFAULT_RETRIES;

                background_dfu_transport_state_update(p_dfu_ctx);
            }

            break;
        }

        case BACKGROUND_DFU_DOWNLOAD_TRIG:
        {
            if (event == BACKGROUND_DFU_EVENT_TRANSFER_COMPLETE)
            {
                if (!is_image_different(p_dfu_ctx))
                {
                    NRF_LOG_INFO("Image is already installed");
                    background_dfu_reset_state(p_dfu_ctx);
                    break;
                }

                p_dfu_ctx->dfu_diag.prev_state = BACKGROUND_DFU_DOWNLOAD_TRIG;

                p_dfu_ctx->dfu_state = BACKGROUND_DFU_DOWNLOAD_INIT_CMD;
                uint32_t offset = 0;

                if (!is_init_command_valid(p_dfu_ctx, &offset))
                {
                    p_dfu_ctx->p_resource_size = &p_dfu_ctx->init_cmd_size;
                    p_dfu_ctx->block_num       = (offset / DEFAULT_BLOCK_SIZE);
                    p_dfu_ctx->retry_count     = DEFAULT_RETRIES;

                    background_dfu_transport_state_update(p_dfu_ctx);

                    block_manager_init(&p_dfu_ctx->block_manager,
                                       p_dfu_ctx->dfu_state,
                                       *p_dfu_ctx->p_resource_size,
                                       p_dfu_ctx->block_num);

                    if (p_dfu_ctx->dfu_mode == BACKGROUND_DFU_MODE_MULTICAST)
                    {
                        NRF_LOG_INFO("Init complete. Multicast Mode.");
                        uint32_t jitter = block_request_jitter_get();
                        err_code = app_timer_start(m_missing_block_timer,
                                                   APP_TIMER_TICKS(jitter),
                                                   p_dfu_ctx);
                        if (err_code != NRF_SUCCESS)
                        {
                            NRF_LOG_ERROR("Error in app_timer_start (%d)", err_code);
                        }
                    }
                    else
                    {
                        NRF_LOG_INFO("Init complete. Unicast Mode.");
                    }

                    break;
                }

                NRF_LOG_INFO("Valid init command found. Continue with firmware download.");
                // fallthrough - init command is completed and we should
                //               continue with firmware download
            }
        }

        /* no break */
        case BACKGROUND_DFU_DOWNLOAD_INIT_CMD:
        {
            if (event == BACKGROUND_DFU_EVENT_TRANSFER_COMPLETE)
            {
                p_dfu_ctx->dfu_diag.prev_state = BACKGROUND_DFU_DOWNLOAD_INIT_CMD;

                if (p_dfu_ctx->dfu_mode == BACKGROUND_DFU_MODE_MULTICAST)
                {
                    stop_block_timeout_timer(p_dfu_ctx);
                }

